### Examples:

In [1]:
# name, gender, age

In [59]:
import pandas as pd

In [60]:
df = pd.DataFrame(columns=['Name', 'Gender', 'Age'])

In [61]:
df['Name'] = ['Danish', 'Yachit', 'Raj','Preet', 'Abhitanshu', 'Arsh', 'Tarun', 'Tanveer', 'Sehaj', 'Bikram']
df['Gender'] = ['Male', 'Female', 'Female', 'Male', 'Male', 'Male', 'Male', 'Female', 'Male', 'Female']
df['Age'] = [21,20,20, 19, 16, 25,10, 50, 30,60]

In [62]:
df

         Name  Gender  Age
0      Danish    Male   21
1      Yachit  Female   20
2         Raj  Female   20
3       Preet    Male   19
4  Abhitanshu    Male   16
5        Arsh    Male   25
6       Tarun    Male   10
7     Tanveer  Female   50
8       Sehaj    Male   30
9      Bikram  Female   60

In [63]:
df[(df['Gender'] == 'Female') & (df['Age'] >= 20)]

      Name  Gender  Age
1   Yachit  Female   20
2      Raj  Female   20
7  Tanveer  Female   50
9   Bikram  Female   60

In [64]:
df.iloc[0:5,0:2]

         Name  Gender
0      Danish    Male
1      Yachit  Female
2         Raj  Female
3       Preet    Male
4  Abhitanshu    Male

In [67]:
df.groupby('Age').sum()

           Name        Gender
Age
10        Tarun          Male
16   Abhitanshu          Male
19        Preet          Male
20    YachitRaj  FemaleFemale
21       Danish          Male
25         Arsh          Male
30        Sehaj          Male
50      Tanveer        Female
60       Bikram        Female

In [68]:
df.groupby('Gender').apply(lambda x: x.count())

C:\Users\dsdd\AppData\Local\Temp\ipykernel_20952\3678995467.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby('Gender').apply(lambda x: x.count())

        Name  Gender  Age
Gender
Female     4       4    4
Male       6       6    6

In [69]:
import numpy as np
df['Age'].apply(np.sqrt)

0    4.582576
1    4.472136
2    4.472136
3    4.358899
4    4.000000
5    5.000000
6    3.162278
7    7.071068
8    5.477226
9    7.745967
Name: Age, dtype: float64

In [73]:
df.isnull().sum()

Name      0
Gender    0
Age       0
dtype: int64

In [78]:
df.shape

(10, 3)

In [85]:
df.to_csv('students.csv', index=False)

In [88]:
df['Gender'].value_counts()

Gender
Male      6
Female    4
Name: count, dtype: int64

In [90]:
df.rename(columns={'Gender':'Sex'})

         Name     Sex  Age
0      Danish    Male   21
1      Yachit  Female   20
2         Raj  Female   20
3       Preet    Male   19
4  Abhitanshu    Male   16
5        Arsh    Male   25
6       Tarun    Male   10
7     Tanveer  Female   50
8       Sehaj    Male   30
9      Bikram  Female   60

In [95]:
from sklearn.impute import SimpleImputer
mean_imp = SimpleImputer(missing_values=np.nan, strategy='mean')
mean_imp.fit_transform((df['Age'].values).reshape(1,-1))

array([[21., 20., 20., 19., 16., 25., 10., 50., 30., 60.]])

In [98]:
from fancyimpute import KNN
xFilledKNN = KNN(k=1).fit_transform((df['Age'].values).reshape(1,-1))

Imputing row 1/1 with 0 missing, elapsed time: 0.000

e:\ML-lab\venv\Lib\site-packages\fancyimpute\solver.py:55: UserWarning: Input matrix is not missing any values
  warnings.warn("Input matrix is not missing any values")

# Lab Assignment 2

In [116]:
import pandas as pd

#### Examine the values of each attribute and Select a set of attributes only that would affect to predict future bike buyers to create your input for data mining algorithms. Remove all the unnecessary attributes. (Select features just by analysis).

In [119]:
df = pd.read_csv('dataset/AWCustomers.csv')

In [121]:
df

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,21173,NaN,Chad,C,Yuan,NaN,7090 C. Mount Hood,NaN,Wollongong,New South Wales,...,Bachelors,Clerical,M,M,1,3,0,1,81916,2017-03-06
1,13249,NaN,Ryan,NaN,Perry,NaN,3651 Willow Lake Rd,NaN,Shawnee,British Columbia,...,Partial College,Clerical,M,M,1,2,1,2,81076,2017-03-06
2,29350,NaN,Julia,NaN,Thompson,NaN,1774 Tice Valley Blvd.,NaN,West Covina,California,...,Bachelors,Clerical,F,S,0,3,0,0,86387,2017-03-06
3,13503,NaN,Theodore,NaN,Gomez,NaN,2103 Baldwin Dr,NaN,Liverpool,England,...,Partial College,Skilled Manual,M,M,1,2,1,2,61481,2017-03-06
4,22803,NaN,Marshall,J,Shan,NaN,Am Gallberg 234,NaN,Werne,Nordrhein-Westfalen,...,Partial College,Skilled Manual,M,S,1,1,0,0,51804,2017-03-06
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18356,25414,NaN,Grace,C,Bailey,NaN,6627 Camelback Ct.,NaN,Coronado,California,...,Graduate Degree,Skilled Manual,F,M,0,1,0,2,52953,2017-03-06
18357,11459,NaN,Tasha,NaN,Deng,NaN,9627 Kendall Rd,NaN,Port Macquarie,New South Wales,...,Bachelors,Skilled Manual,F,S,0,2,0,0,60992,2017-03-06
18358,12160,NaN,Jaclyn,NaN,Zhang,NaN,4364 Viera Avenue,NaN,Beaverton,Oregon,...,Partial College,Skilled Manual,F,S,0,2,0,0,51859,2017-03-06
18359,14353,NaN,Erin,I,Reed,NaN,3866 Mt. Everest Court,NaN,Vancouver,British Columbia,...,High School,Clerical,F,S,0,0,0,0,87177,2017-03-06
18360,16676,NaN,Amanda,NaN,Perry,NaN,7870 Orangewood Dr.,NaN,Grossmont,California,...,Graduate Degree,Professional,F,M,1,2,0,0,136856,2017-03-06

In [123]:
df.isnull().sum()

CustomerID                  0
Title                   18260
FirstName                   0
MiddleName               7789
LastName                    0
Suffix                  18358
AddressLine1                0
AddressLine2            18050
City                        0
StateProvinceName           0
CountryRegionName           0
PostalCode                  0
PhoneNumber                 0
BirthDate                   0
Education                   0
Occupation                  0
Gender                      0
MaritalStatus               0
HomeOwnerFlag               0
NumberCarsOwned             0
NumberChildrenAtHome        0
TotalChildren               0
YearlyIncome                0
LastUpdated                 0
dtype: int64

In [125]:
df.columns

Index(['CustomerID', 'Title', 'FirstName', 'MiddleName', 'LastName', 'Suffix',
       'AddressLine1', 'AddressLine2', 'City', 'StateProvinceName',
       'CountryRegionName', 'PostalCode', 'PhoneNumber', 'BirthDate',
       'Education', 'Occupation', 'Gender', 'MaritalStatus', 'HomeOwnerFlag',
       'NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren',
       'YearlyIncome', 'LastUpdated'],
      dtype='object')

#### Create a new Data Frame with the selected attributes only.

In [128]:
df.drop(['CustomerID', 'Title','FirstName', 'MiddleName', 'LastName', 'Suffix','AddressLine1', 'AddressLine2', 'City', 'PhoneNumber', 'StateProvinceName', 'CountryRegionName', 'Education', 'Gender', 'MaritalStatus', 'HomeOwnerFlag', 'NumberChildrenAtHome', 'TotalChildren', 'LastUpdated'], axis=1, inplace=True)

In [130]:
df

      PostalCode   BirthDate      Occupation  NumberCarsOwned  YearlyIncome
0           2500  1987-11-13        Clerical                3         81916
1        V9B 2C3  1972-07-21        Clerical                2         81076
2          91791  1985-11-09        Clerical                3         86387
3         L4 4HB  1977-10-18  Skilled Manual                2         61481
4          59368  1975-02-05  Skilled Manual                1         51804
...          ...         ...             ...              ...           ...
18356      92118  1990-11-11  Skilled Manual                1         52953
18357       2444  1992-10-13  Skilled Manual                2         60992
18358      97005  1983-11-24  Skilled Manual                2         51859
18359    V7L 4J4  1995-06-15        Clerical                0         87177
18360      91941  1986-03-26    Professional                2        136856

[18361 rows x 5 columns]

In [132]:
df.dtypes

PostalCode         object
BirthDate          object
Occupation         object
NumberCarsOwned     int64
YearlyIncome        int64
dtype: object

#### Determine a Data value type (Discrete, or Continuous, then Nominal, Ordinal, Interval, Ratio) of each attribute in your selection to identify preprocessing tasks to create input for your data mining.

In [135]:
print('Discrete: PostalCode, NumberCarsOwned, Occupation')
print('Continuous: YearlyIncome, BirthDate')
print('Nominal: PostalCode')
print('Ordinal: Occupation')
print('Interval: YearlyIncome, BirthDate')
print('Ratio: NumberCarsOwned')

Discrete: PostalCode, NumberCarsOwned, Occupation
Continuous: YearlyIncome, BirthDate
Nominal: PostalCode
Ordinal: Occupation
Interval: YearlyIncome, BirthDate
Ratio: NumberCarsOwned

### Data Preprocessing and Transformation

In [138]:
df.columns

Index(['PostalCode', 'BirthDate', 'Occupation', 'NumberCarsOwned',
       'YearlyIncome'],
      dtype='object')

In [140]:
# Null values
df.isnull().sum()

PostalCode         0
BirthDate          0
Occupation         0
NumberCarsOwned    0
YearlyIncome       0
dtype: int64

In [142]:
# Binning

In [144]:
import numpy as np

In [146]:
bins = np.linspace(min(df['YearlyIncome']), max(df['YearlyIncome']),4)
groupNames=['Poor', 'MiddleClass', 'Rich']
df['YearlyIncome'] = pd.cut(df['YearlyIncome'], bins=bins, labels=groupNames)

In [148]:
df['YearlyIncome']

0        MiddleClass
1        MiddleClass
2        MiddleClass
3               Poor
4               Poor
            ...
18356           Poor
18357           Poor
18358           Poor
18359    MiddleClass
18360           Rich
Name: YearlyIncome, Length: 18361, dtype: category
Categories (3, object): ['Poor' < 'MiddleClass' < 'Rich']

In [150]:
df.head()

  PostalCode   BirthDate      Occupation  NumberCarsOwned YearlyIncome
0       2500  1987-11-13        Clerical                3  MiddleClass
1    V9B 2C3  1972-07-21        Clerical                2  MiddleClass
2      91791  1985-11-09        Clerical                3  MiddleClass
3     L4 4HB  1977-10-18  Skilled Manual                2         Poor
4      59368  1975-02-05  Skilled Manual                1         Poor

In [152]:
df['YearlyIncome'].unique()

['MiddleClass', 'Poor', 'Rich', NaN]
Categories (3, object): ['Poor' < 'MiddleClass' < 'Rich']

In [154]:
# Normalization

In [156]:
from sklearn.preprocessing import MinMaxScaler
scaler=MinMaxScaler()

In [158]:
df[['NumberCarsOwned']] = scaler.fit_transform(df[['NumberCarsOwned']])
df['NumberCarsOwned'].head()

0    0.6
1    0.4
2    0.6
3    0.4
4    0.2
Name: NumberCarsOwned, dtype: float64

In [169]:
# OneHotEncoding
from sklearn.preprocessing import OneHotEncoder

In [171]:
encoder=OneHotEncoder(sparse_output=False)

In [173]:
OneHot=encoder.fit_transform(df[['YearlyIncome']])

In [175]:
OneHot

array([[1., 0., 0., 0.],
       [1., 0., 0., 0.],
       [1., 0., 0., 0.],
       ...,
       [0., 1., 0., 0.],
       [1., 0., 0., 0.],
       [0., 0., 1., 0.]])

In [177]:
encoded_income=encoder.fit_transform(df[['YearlyIncome']])

In [179]:
encoded_income_df=pd.DataFrame(encoded_income, columns=encoder.get_feature_names_out(['YearlyIncome']))

In [181]:
df=pd.concat([df.drop('YearlyIncome', axis=1), encoded_income_df],axis=1)
df.head()

,PostalCode,BirthDate,NumberCarsOwned,Occupation_Clerical,Occupation_Management,Occupation_Manual,Occupation_Professional,Occupation_Skilled Manual,YearlyIncome_MiddleClass,YearlyIncome_Poor,YearlyIncome_Rich,YearlyIncome_nan
0,2500,1987-11-13,0.6,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
1,V9B 2C3,1972-07-21,0.4,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
2,91791,1985-11-09,0.6,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
3,L4 4HB,1977-10-18,0.4,0.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0,0.0
4,59368,1975-02-05,0.2,0.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0,0.0

In [160]:
encoder1 = OneHotEncoder(sparse_output=False)

In [162]:
encoded_occupation=encoder1.fit_transform(df[['Occupation']])

In [164]:
encoded_occupation_df = pd.DataFrame(encoded_occupation, columns=encoder1.get_feature_names_out(['Occupation']))

In [166]:
df = pd.concat([df.drop('Occupation',axis=1), encoded_occupation_df], axis=1)
df.head()

,PostalCode,BirthDate,NumberCarsOwned,YearlyIncome,Occupation_Clerical,Occupation_Management,Occupation_Manual,Occupation_Professional,Occupation_Skilled Manual
0,2500,1987-11-13,0.6,MiddleClass,1.0,0.0,0.0,0.0,0.0
1,V9B 2C3,1972-07-21,0.4,MiddleClass,1.0,0.0,0.0,0.0,0.0
2,91791,1985-11-09,0.6,MiddleClass,1.0,0.0,0.0,0.0,0.0
3,L4 4HB,1977-10-18,0.4,Poor,0.0,0.0,0.0,0.0,1.0
4,59368,1975-02-05,0.2,Poor,0.0,0.0,0.0,0.0,1.0